Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚོལ་ཞིང་མཆིས་པ་ལས། དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་རྙེད་ནས།
en: They searched for the Tathāgata, the Arhat, the totally and completely awakened Buddha, and not having found the Tathāgata, the Arhat, the totally and completely awakened Buddha,

source: སྟན་ལས་ལངས་ཏེ།
en: they rose from their seats and

source: སོ་སོར་གྱེས་པ་དེ་དག་གི་ནང་ནས། ལྷ་ཆེ་བར་གྲགས་སོ་འཚལ་གནས་ནས་ཤི་འཕོས་ཤིང་མི་སྣང་བར་གྱུར་ནས།
en: went their separate ways, and while the more prominent gods among them remained to search further, the others died, transmigrated, and disappeared.

source: བཙུན་པ་ལྷ་ཆེ་བར་གྲགས་སོ་འཚལ་གནས་ནས་ཤི་འཕོས་པས་བདག་ཀྱང་སྐྲག་ཅིང་བག་ཚ་བར་གྱུར་ཏེ། བདག་ཀྱང་གནས་འདི་ནས་ཤི་འཕོས་པར་མི་འགྱུར་གྲང་སྙམ་ནས།
en: “Lord, when even those most prominent gods died and transmigrated, I grew panicked and afraid, thinking, ‘Will I too die and transmigrate?’

source: བདག་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་གཅིག་པུ་དབེན་པར་གནས་པས་གནས་ཤིང་མཆིས་པ། གང་དང་གང་མཐོང་བ་དེ་དང་དེ་དག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལགས་སྙམ་ནས། དེ་དག་གི་ཐད་དུ་མཆིས་ན།
en: And wherever I saw ascetics and brahmins living in isolation, thinking that they were the tathāgatas, the arhats, the totally and completely awakened buddhas, I approached them.

source: དེ་དག་གིས་བདག་ལ་ཁྱོད་སུ་ཡིན་ཞེས་འདྲི་བར་བགྱིད་དེ།
en: “ ‘Who are you?’ they would ask me,

source: བདག་གིས་དེ་དག་ལ་བདག་ནི་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཡིན་ནོ་ཞེས་བགྱིས་ནས།
en: and I responded, ‘I am Śakra, King of the Gods.’

source: དེ་དག་དགའ་ཞིང་མགུ་སྟེ།
en: Then in joy and gladness they exclaimed,

source: ཀྱེ་མ་བདག་གིས་བརྒྱ་བྱིན་མཐོང་ངོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་རྗོད་པར་བགྱིད་དེ། དེ་དག་བདག་ལ་འདྲི་བར་བགྱིད་ཀྱིས། དེ་དག་ལ་བདག་འདྲི་བར་མི་བགྱིད་ལགས་སོ། །
en: ‘Oh, we have seen Śakra!’ over and over again, and began to ask questions of me, so I did not put my questions to them.

source: དེ་དག་བདག་ལ་སྐྱབས་སུ་མཆི་བར་བགྱིད་ཀྱིས། བདག་དེ་དག་ལ་སྐྱབས་སུ་མཆི་བར་མི་བགྱིད་ལགས་སོ། །
en: They took refuge in me, so I did not take refuge in them.

source: ད་སླན་ཅད་བདག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ལགས་ཏེ།
en: “From this day forth I am a disciple of the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་མཆིས་ལགས་སོ། །
en: I take my refuge in the Blessed One.

source: རྟོགས་པ་ལ་ནི་མཐའ་མ་མཆིས། །བདག་ལ་ཐེ་ཙོམ་ནེམ་ནུར་མཆིས། །
en: “There’s no end to thought construction. I have had so many doubts and qualms.

source: དེ་བཞིན་གཤེགས་པ་ཚོལ་བའི་ཕྱིར། །རིང་པོ་ཞིག་ཏུ་འཁྱམ་འཁྱམ་སྟེ། །
en: Thus I ranged about so long, In search of the Tathāgata.

source: ལོང་བ་བདག་ནི་རྫོགས་སངས་རྒྱས། །བསྙེན་བཀུར་བགྱིད་དུ་མཆིས་མཆི་ན། །བདག་གིས་ཇི་ལྟར་མཉེས་པའི་ཐབས། །དེ་དག་ལ་ནི་དྲིས་པ་ལས། །ལམ་དང་དེ་བཞིན་བསྒྲུབ་པ་ཡང་། །
en: “In blindness I have come to serve The perfect Buddha, and since I know not, I have to ask of all the rest The means by which to please him best— “With what practice, by what path?

source: དེ་དག་ཡང་གི་གཏམ་མ་འཚལ། །
en: But no answer do they give at all.

source: བདག་ནི་ཅུང་ཟད་ཅི་འདོད་པ། །རྟོག་པར་གྱུར་དང་དཔྱད་པ་དང་། །ཡིད་ཀྱི་འགྲོ་དང་འོང་བ་ཡིས། །སེམས་ནི་ཐུགས་ཀྱིས་ཐུགས་སུ་ཆུད། །ཡིད་ཀྱང་ཡིད་ཀྱིས་རིག་གྱུར་ནས། །དེ་དག་ཐམས་ཅད་དེ་རིང་དུ། །
en: Blessed One, you apprehend All my wishes, however small, “Whatever I think, all I assess, Whence the mind comes, and where it goes. All of us whose minds are known by yours, Each one of us, upon this day—

source: བཅོམ་ལྡན་འདས་ནི་དགྲ་བཅོམ་གྱིས། །བསྒྲགས་ཤིང་ལུང་ཡང་བསྟན་པར་གྱུར། །
en: “Blessed One, arhat, we request You make a statement, give some word.

source: ཁྱོད་ནི་སངས་རྒྱས་སྟོན་པ་ཁྱོད། །རྒྱལ་བ་ཁྱོད་ཀྱིས་བདུད་ཀྱང་བཏུལ། །
en: Buddha, awakened teacher, Victor, Māra’s tamer, skillful

source: ཁྱོད་ཀྱིས་བག་ཉལ་བཅད་ནས་ཀྱང་། །རྒལ་ནས་སྐྱེ་དགུ་སྒྲོལ་བར་མཛད། །
en: “Surgeon for latent afflictions, You who safely arrived, and yet returns To rescue all beings—

source: འཇིག་རྟེན་དུ་ནི་ཁྱོད་སངས་རྒྱས། །
en: In this world you are the Buddha,

source: ཁྱོད་ལས་ལྷག་པ་ཡང་མ་མཆིས། །
en: “And you alone are unsurpassed.

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ན། །གང་ཟག་ཁྱོད་ཀྱི་ཟླ་མ་མཆིས། །
en: Not in all the world nor even Among the gods have you any peer.

source: དཔའ་བོ་ཆེན་པོ་ཁྱོད་ལ་འདུད། །
en: Great hero, to you I bow.

source: སྐྱེས་མཆོག་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Highest of persons, to you I bow.

source: སྲིད་པའི་ཟུག་རྔུ་འབྱིན་པ་སྟེ། །ཉི་མའི་རིགས་སྐྱེས་ཁྱོད་ལ་འདུད། །
en: I bow to the one From the Clan of the Sun Who removes the thorn of existence.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱིས་སྔོན་ཆད་བདེན་པ་ཐོབ་པ་དང་། ཡིད་བདེ་བ་ཐོབ་པ་འདི་ལྟ་བུ་ཉམས་སུ་མྱོང་བར་དྲན་ནམ།
en: “Kauśika,” the Blessed One asked him, “do you recall ever attaining such a truth, or attaining experiences of such happiness?”

source: བརྒྱ་བྱིན་གྱིས་གསོལ་པ།
en: Śakra, King of the Gods, replied,

source: ཡིད་བདེ་བ་ཐོབ་པ་ནི་བདག་གིས་མྱོང་བར་དྲན་ལགས་སོ། །
en: “I recall attaining experiences of happiness.

source: བདེན་པ་ཐོབ་པ་ནི་ཉམས་སུ་མྱོང་བ་མི་དྲན་ལགས་སོ། །
en: But I can’t recall an experience of attaining the truth.

source: བཙུན་པ་ལན་གཅིག་ཅིག་ན། ལྷ་དང་ལྷ་མ་ཡིན་གཡུལ་འགྱེད་པ་ན།
en: Lord, there was one time when the gods and demigods were waging war on one another,

source: ལྷ་རྣམས་ནི་རྒྱལ། ལྷ་མ་ཡིན་རྣམས་ནི་ཕམ་ནས།
en: and the gods were victorious and the demigods defeated.

source: བདག་གིས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Thereupon I thought,

source: ད་ནི་བདག་ལྷའི་གྲོང་ཁྱེར་དུ་མཆིས་ལ།
en: ‘Here I am now in the city of the gods.

source: ལྷའི་ལོངས་སྤྱོད་གང་ལགས་པ་དང་། ལྷ་མ་ཡིན་གྱི་ལོངས་སྤྱོད་གང་ལགས་པ་དེ་དག་ལྷན་ཅིག་ཏུ་ཚོགས་པ་དགའ་བཞིན་དུ་ལོངས་སྤྱོད་པར་བགྱིའོ། །
en: I will gather up all the pleasures of the gods and all the pleasures of the demigods and enjoy them for myself.’

source: སྙམ་པ་དེ་ནི་ཡིད་བདེ་བ་ཐོབ་པ་ལགས་ཏེ། དེ་ནི་ཡུན་རིང་པོར་འཐབ་མོའི་མཐའ་ཅན་ལགས། མཚང་འདྲུ་བའི་མཐའ་ཅན་ལགས། འགྱེད་པའི་མཐའ་ཅན་ལགས། རྩོད་པའི་མཐའ་ཅན་ལགས་སོ། །
en: That attainment of happiness came on the heels of war, on the heels of reproof, on the heels of conflict, on the heels of contention.

source: བཙུན་པ་བདག་གིས་ཡིད་བདེ་བ་ཐོབ་པ་དང་། བདེན་པ་མཐོང་བ་འདི་ནི་ཡུན་རིང་པོར་འཐབ་མོ་མ་མཆིས་པའི་མཐའ་ཅན་ལགས། མཚང་འདྲུ་བ་མ་མཆིས་པའི་མཐའ་ཅན་ལགས། འགྱེད་པ་མ་མཆིས་པའི་མཐའ་ཅན་ལགས། རྩོད་པ་མ་མཆིས་པའི་མཐའ་ཅན་ལགས་སོ། །
en: But, Lord, the achievement of this happiness—this vision of truth—does not come on the heels of war, nor on the heels of reproof, nor on the heels of conflict, nor on the heels of contention.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཆོས་ཀྱི་རྗེས་སུ་འགྲོ་བའི་བཀའ་དྲིན་སྩལ་བ་གང་ལགས་པ་དེ་ལ་བདག་འདི་སྙམ་བགྱིད་དེ།
en: “Lord, when I think of the kindness the Blessed One did in bringing me to the Dharma, I think,

source: བདག་གནས་འདི་ནས་ཤི་འཕོས་ནས་མི་རྣམས་དང་སྐལ་བ་མཉམ་པར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་དང་། རྫས་དང་ཡོ་བྱད་མང་བ་དང་། བདོག་པ་མང་བ་དང་། ནོར་དང་། འབྲུ་དང་། གསེར་དང་། དངུལ་དང་། མཛོད་དང་། བང་བའི་ཚོགས་མང་བའི་རིགས་གང་ལགས་པ་དང་། མཛའ་བོ་དང་། གྲོགས་པོ་དང་། ཕུ་ནུ་དང་། ཉེ་དུ་མང་བ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་མང་བ་དེ་ལྟ་བུའི་ཁྱིམ་དུ་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་གྱུར་ཅིག །
en: ‘When I die from here and transmigrate, may I take rebirth in a house equal in fortune to prosperous and wealthy persons of vast and magnificent means with many nice things, belongings, and personal effects; with riches, grain, gold, silver, treasure houses, and multitudes of every type of granary; and with many who are near and dear, friends, siblings, kin, servants both male and female, workers, and others to whom wages are paid.

source: དེ་ནས་བདག་མཐར་གྱིས་སྐྱེས་ཏེ། དབང་པོ་རྣམས་སྨིན་ནས། སྦྱིན་བདག་བྱིན་ཞིང་བསོད་ནམས་དག་བགྱིད་ནས། སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ། ཆོས་གོས་ཚོན་ཅན་བགོས་ནས་ཡང་དག་པའི་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་སྟེ།
en: “ ‘And after I eventually take birth there and my faculties ripen, when I have given gifts and made merit, shaved my head and face, donned the colorful religious robes, and with nothing short of perfect faith gone forth from home to live as a mendicant,

source: བཙུན་པ་བདག་འོས་པར་གནས་ཤིང་། གལ་ཏེ་བཀའ་ལུང་ཐོབ་ན་བཀའ་ལུང་བཞིན་བགྱིད་པར་གྱུར་ཅིག །
en: Lord, if I am then worthy and receive spiritual instruction, may I practice according to the instruction given.

source: དེ་ལྟར་བདག་འོས་པར་གནས་ན། སྡུག་བསྔལ་གྱི་མཐར་ཐུག་པ་ནི་དེ་ལགས་སོ་སྙམ་བགྱིད་དོ། །
en: In so doing, if I am worthy, it shall be the end of suffering.’

source: གལ་ཏེ་བཀའ་ལུང་མ་ཐོབ་ན་ནི་དེ་ལྟར་ན་བདག་གཟུགས་མཆིས་པའི་ལྷའི་ལུས་སྐྱེས་པ། དབང་པོ་མ་ཉམས་ཤིང་དབང་པོ་ཚང་བ་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་དང་ལྡན་པ། མདོག་བཟང་བ། རང་ལ་འོད་མཆིས་པ། ནམ་མཁའ་ལ་འགྲོ་བ། དགའ་བའི་ཟས་ཟ་བ། དགའ་བའི་ཟས་དང་ལྡན་པ། ཚེ་རིང་བ་ཡུན་རིང་དུ་གནས་པ་དེར། བདག་འགྲན་ཟླ་མ་མཆིས་པར་སྐྱེ་བར་ཤོག་ཤིག་སྙམ་བགྱིད་དོ། །
en: “And I also think to myself, ‘Should I not receive spiritual instruction, then taking birth in divine form, may my faculties not deteriorate, and my faculties be unimpaired, with all limbs and digits and other parts of the body intact, with a fine complexion, and may I be illuminated from within, travel the sky, and partake of delightful food—blessed with delightful food and a long life free of any who would oppose me.’

source: ལྷ་ལུས་འདི་ལས་ཤི་འཕོས་ཤིང་། །མི་མ་ཡིན་པའི་ཚེ་སྤངས་ནས། །
en: “Dead, transmigrated, no longer a god, Now rid of nonhuman life—

source: རྨོངས་པ་མེད་པར་མངལ་དུ་འཇུག །བདག་གི་ཡིད་ནི་སྡོམ་ལ་དགའ། །
en: After I enter the womb, my ignorance gone, May the vows please my mind.

source: མན་ངག་གིས་ནི་ཕོངས་མི་འགྱུར། །
en: “May I never lack for instruction.

source: བསྟན་པའི་ལམ་ལ་རྟེན་བཅས་ཤིང་། །ཚངས་པར་སྤྱོད་ལ་གཞོལ་བགྱིས་ནས། །
en: Trusting in the way that I’ve been taught, Upholding the holy life,

source: བསོད་སྙོམས་རྒྱུ་བ་སྤྱད་པར་བགྱི། །
en: May I take up the practice of going for alms.

source: བདག་ནི་འོས་པར་གནས་ནས་ཀྱང་། །གལ་ཏེ་བཀའ་ལུང་ཐོབ་གྱུར་ན། །བཀའ་ལུང་སྩལ་བ་བཞིན་དུ་བགྱི། །
en: “And if worthy, when I then receive Spiritual instruction, let my comportment be Just as I have been instructed.

source: དེ་ཉིད་བདག་གི་སྡུག་བསྔལ་མཐའ། །
en: This would be my suffering’s end.

source: གལ་ཏེ་དེ་ལྟར་མ་གྱུར་ནས། །ཚེ་ཡི་མཐའ་ནི་ཟད་པའི་ཚེ། །འོག་མིན་ལྷ་ནི་གང་ཡིན་པ། །དེ་དག་ཏུ་ནི་སྐྱེ་བར་ཤོག །
en: “Should it not come to pass, Then when my lifespan, worn out, slips away Let me take birth As a god of Akaniṣṭha.

source: བཅོམ་ལྡན་འདས་བདག་ནི་རྒྱུན་དུ་ཞུགས་པ་ལགས་སོ། །
en: “Blessed One, I am a stream enterer.

source: བདེ་བར་གཤེགས་པ་བདག་ནི་རྒྱུན་དུ་ཞུགས་པ་ལགས་སོ། །
en: Sugata, I am a stream enterer.

source: ལན་ཅིག་ཕྱིར་འོང་བར་འགྱུར་བའི་རེ་བ་ཡང་བདག་ལ་མཆིས་ལགས་སོ། །
en: It is my hope to one day be a once-returner.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་ལེགས་སོ་ལེགས་སོ། །
en: “Very good, Kauśika, very good!

source: དེའི་སྐལ་བ་ཁྱོད་ལ་ཡོད་དེ། དེ་ཡང་བག་ཡོད་པས་འཐོབ་བོ། །
en: The good fortune with which you are blessed The heedful can also achieve.”

source: གང་གིས་བདག་ནི་ཞི་འགྱུར་ལ། །རྒྱུན་དུ་ཞུགས་པར་ངེས་འབྱུང་བ། །བཅོམ་ལྡན་ཁྱོད་ལས་གཞན་ལ་མེད། །
en: “That which made me so peaceable, And brought me stream entry as well, Belongs only to you, Blessed One,

source: ཁྱོད་ཀྱི་བསྟན་ལས་གཞན་ལ་མེད། །
en: And only comes from your teaching.

source: ཁྱད་པར་རྒྱ་ཆེན་དང་པོའི་གཞི། །གཞན་དག་ལྟ་ལ་ག་ལ་མཆིས། །
en: “Its foundation is uncommonly vast— What place is there, then, for another?

source: ཁྱད་པར་ཐོབ་པ་ཅི་འདྲ་བ། །སྔོན་ཆད་གཞན་ལས་ཡོང་མ་ཐོབ། །
en: Anything like it accomplished before, Was not something received from another.

source: བཙུན་པ་བདག་ནི་འདི་ཉིད་ན། །མཆིས་ཤིང་ལྷ་ལུས་བགྱིད་བཞིན་དུ། །བདག་གིས་ཚེ་རིང་ཐོབ་ལགས་ཀྱིས། །བློ་ལྡན་དེ་ལྟར་གཟུང་དུ་གསོལ། །
en: “Lord, as I stand here before you In the form of a god, Please, wise one, I request— Grant that I live long.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ལྷ་བརྒྱད་ཁྲི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་ཏེ།
en: When this Dharma teaching had been explained, Śakra, King of the Gods, and his suite of eighty thousand divine attendants were able to see these things unobscured, with the Dharma vision that has no trace of dust or stain with respect to phenomena.

source: དེས་བདེན་པ་མཐོང་ནས། སྟན་དེ་ཁོ་ན་ལས་ཤི་འཕོས་ནས། སྟན་དེ་ཁོ་ན་ཉིད་ལ་ཕྱིར་སྐྱེས་སོ། །
en: And having seen the truths, Śakra died, transmigrated, and took birth again right where he sat.

source: དེ་ལྟར་དེ་ཤི་འཕོས་པ་དང་། སྐྱེས་པ་ནི་མིག་མི་འཛུམས་པ་དང་། མི་སྣང་བར་གྱུར་པ་དང་། ལུས་ཀྱི་རེག་པའི་སྒོ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་ཏོ། །
en: The Blessed One knew by touching his body that he had died, transmigrated, and taken rebirth without so much as closing his eyes or disappearing.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ལྷ་མ་ཡིན་གྱི་བུ་མོ་བདེ་སོགས་ཀྱིས་ཀྱང་རྟོགས་སོ། །
en: Śakra, King of the Gods, the young demigoddess Śacī, and the others recognized it too,

source: དེ་ནས་ལྷ་མ་ཡིན་གྱི་བུ་མོ་བདེ་སོགས་ཀྱིས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་སྨྲས་པ།
en: and the young demigoddess Śacī and the others asked Śakra, King of the Gods,

source: ཀཽ་ཤི་ཀ་ཁྱོད་ཤི་འཕོས་ནས། སྐྱེས་ལགས་སམ།
en: “Kauśika, have you died and taken rebirth?”

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། བདེ་སོགས་ང་ཤི་འཕོས་ནས་ཕྱིར་སྐྱེས་ཏེ།
en: “Yes, Śacī,” Śakra replied, “and all of you—I did die, transmigrate, and take rebirth.

source: འདི་ན་འདུག་བཞིན་དུ་ཕྱིར་བདག་གི་ཚེ་ཐོབ་པར་གྱུར་ཏོ། །
en: I acquired an extension of my lifespan right here where I sit.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བདེན་པ་མཐོང་ནས་དགའ་ཞིང་མགུ་ལ་རབ་ཏུ་དགའ་ཞིང་ཡི་རངས་ཏེ།
en: Now Śakra, King of the Gods, having seen the truths, was jubilant, joyous, and glad.

source: དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: Feeling jubilant, joyous, and glad, he rose from his seat, drew down the right shoulder of his upper garment,

source: བཙུན་པ་བདག་ནི་འཕགས་ལགས་སོ། །འཕགས་ལགས་སོ། །
en: “Lord, I have become a noble one. I am a noble one.

source: དེང་སླན་ཅད་ཇི་སྲིད་འཚོའི་བར་དུ་དགེ་བསྙེན་ལགས་པ་དང་། ཁོང་ནས་དགའ་སྟེ་སྐྱབས་སུ་མཆིས་ལགས་པར་གཟུང་དུ་གསོལ།
en: As I come to you for refuge, please accept me as a lay vow holder from this day forth for as long as I live, for I am happy to the depths of my heart.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་པ་ལ་སྨྲས་པ།
en: Thereupon Śakra, King of the Gods, said to the young gandharva Pañcaśikha,

source: བུ་ཁྱོད་ནི་བདག་ལ་ཕན་པ་དང་བདེ་བ་ཡིན་ཏེ།
en: “My boy, you are a great help and a delight to me.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་འགྲོ་བར་ཐོག་མ་ཁྱོད་ཀྱིས་བསྐུལ་ཏོ། །
en: It was you who first admonished me to go see the Blessed One.

source: བུ་ཟུར་ཕུད་ལྔ་པ་བདག་ཅག་འདི་ནས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ཡུལ་དུ་དོང་ནས། ཁྱོད་ཀྱིས་སྔོན་ཡུན་རིང་པོ་ནས་འདོད་ཅིང་སྨོན་པ་གང་ཡིན་པའི་དྲི་ཟའི་རྒྱལ་པོ་དུམ་བུ་རུའི་བུ་མོ་བཟང་མོ་ཞེས་བྱ་བ་འོད་བཟངས་དེ། ཁྱོད་ཀྱི་ཆུང་མར་སྦྱིན་ནོ། །
en: Pañcaśikha, when we reach the Heaven of the Thirty-Three, I shall give to you in marriage the one for whom you have hoped and wished for so long—Princess Suprabhā, whom her father, the gandharva king Tumburu, calls ‘sweet one’—

source: དྲི་ཟ་རྣམས་ཀྱི་དབང་པོ་ཁྱོད་ཀྱི་ཕའི་རྒྱལ་སར་ཡང་གཞུག་གོ། །
en: and you yourself shall assume the throne of your father, lord of the gandharvas.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལ་སྨྲས་པ།
en: Śakra, King of the Gods, then spoke to the gods of the Heaven of the Thirty-Three:

source: གྲོགས་པོ་དག་བདག་གིས་སྔོན་ཅད་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ལ། དུས་གསུམ་དུ་ཚངས་པ་ལ་འོས་པའི་འདུད་པ་བྱེད་པ་གང་ཡིན་པ་དེ་ནི། བདག་གིས་ད་ཕྱིན་ཅད་བཅོམ་ལྡན་འདས་འདི་ཉིད་ལ་ཚངས་པ་ལ་འོས་པའི་འདུད་པས་འདུད་པར་བྱའོ། །
en: “My friends, just as I previously did to Sahāṃpati Brahmā throughout the three times, henceforth I shall bow to the Blessed One in the ways I had reserved for Brahmā.

source: འདི་ལྟར་བཅོམ་ལྡན་འདས་འདི་ཉིད་ཚངས་པ་ཡིན།
en: Because the Blessed One himself is Brahmā.

source: ཚངས་པར་གྱུར་པ་ཡིན།
en: He has become Brahmā.

source: ཞི་བ་ཡིན།
en: He is peace.

source: ཞི་བར་གྱུར་པ་ཡིན་པའི་ཕྱིར་རོ། །
en: He is serenity.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ལྷ་གཞན་རྣམས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: Śakra, King of the Gods, and the other gods touched their heads to the Blessed One’s feet,

source: མདུན་གྱིས་ཕྱོགས་ཤིང་ཕྱིར་ནུར་ནས། བཅོམ་ལྡན་འདས་ལ་འདུད་བཞིན་དུ།
en: and slowly backed away while continuing to bow down toward the Blessed One.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་མིག་ལམ་དུ་མི་སྣང་བར་གྱུར་པའི་ས་ནས། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ།
en: And once he was outside the line of sight, Śakra, King of the Gods, drew down the right shoulder of his upper garment,

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: knelt down on his right knee, and said,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ལ་ཕྱག་འཚལ་ལོ་ཕྱག་འཚལ་ལོ་ཞེས་སྨྲས་ནས།
en: “I prostrate to the Blessed One, the Tathāgata, the Arhat, the totally and completely awakened Buddha,”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས། རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བར་གྱུར་ལ།
en: “Lord,” the monks asked the Blessed Buddha, “what action did Śakra, King of the Gods, take that ripened into his becoming a being of great miracles and great power,

source: འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: and such that he pleased the Blessed One, and did not displease him?

source: བཅོམ་ལྡན་འདས་ལྷ་བརྒྱད་ཁྲི་བོ་འདི་རྣམས་ཀྱིས་ཀྱང་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་བརྒྱ་བྱིན་འདི་ཁོ་ན་ལས་བརྟེན་ནས།
en: Blessed One, what action did the eighty thousand gods take that ripened into their entrusting themselves to Śakra alone,

source: གསོལ་པ་འདི་རྣམས་ཀྱིས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “When did they make these prayers?”

source: བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་བཞི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཁོར་བ་འཇིག་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as forty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Krakucchanda was in the world,

source: དེས་གང་གི་ཚེ་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་ནས།
en: the totally and completely awakened Buddha Krakucchanda achieved unexcelled wisdom

source: རྒྱལ་པོའི་ཕོ་བྲང་མཛེས་ལྡན་དུ་གཤེགས་པ་དེའི་ཚེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གི་ཕྱིར་རྒྱལ་པོ་མཛེས་པས། གཙུག་ལག་ཁང་ལྔ་བརྒྱ་བརྩིགས་ཏེ། གནས་ཁང་དྲུག་སྟོང་བྱས་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་ཕུལ་ཏེ།
en: and then traveled to the royal palace known as Śobhāvatī. “At that time King Śobha built five hundred monasteries with six thousand rooms for the totally and completely awakened Buddha Krakucchanda and offered them to the totally and completely awakened Buddha Krakucchanda and the saṅgha of his disciples.

source: གཙུག་ལག་ཁང་དེ་དག་ཏུ་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས། འཁོར་བརྒྱད་ཁྲི་དང་བཅས་པས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ། མཆོད་པའི་ལས་ལ་བརྩོན་པར་གྱུར་ཏོ། །
en: And after King Śobha had provided them with everything they required, he and his suite of eighty thousand attendants put great effort into venerating the totally and completely awakened Buddha Krakucchanda and the saṅgha of his disciples.

source: དེ་ནས་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་ཐམས་ཅད་མཛད་ནས།
en: “When the totally and completely awakened Buddha Krakucchanda had carried out all the activities of a buddha,

source: ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་ཚེ། རྒྱལ་པོ་མཛེས་པས་དེའི་སྐུ་གདུང་ལ་མཆོད་པ་བྱས་ནས།
en: he passed beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates. King Śobha performed veneration rites for the relics of the Blessed One,

source: སྐུ་གདུང་གི་མཆོད་རྟེན་བརྩིགས་ཏེ། རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། མཆོད་རྟེན་དེ་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ཏེ། སྨོན་ལམ་བཏབ་པ།
en: built a reliquary stūpa complete in every respect, made a large offering to the stūpa, and prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས། བདག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་གལ་ཏེ། ལྷར་སྐྱེ་བར་གྱུར་ན་ནི། ལྷ་ཆེ་བར་གྲགས་པ། ལྷ་རྣམས་ཀྱི་མངའ་བདག་ཏུ་གྱུར་ཅིག །
en: ‘By this root of virtue, wherever I am born, may I take birth as a god, a prominent god, a lord among the gods.

source: གལ་ཏེ་མིར་སྐྱེ་བར་གྱུར་ན་ནི་མི་ཆེ་བར་གྲགས་པ་མི་རྣམས་ཀྱི་ནང་ནས་རྒྱལ་སྲིད་ཀྱི་མངའ་བདག་ཏུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Should I take birth as a human, may it be as a prominent human, the lord of a human kingdom.’

source: དེ་ནས་རྒྱལ་པོས་སྨོན་ལམ་འདེབས་པ་ཞམ་རིང་བ་རྣམས་ཀྱིས་མཐོང་ནས་དྲིས་པ།
en: “The king’s servants saw him praying, and asked,

source: ལྷས་སྨོན་ལམ་ཅི་ཞིག་བཏབ་ལགས།
en: ‘Deva, what is the prayer you are making?’

source: དེ་ནས་དེས་དེ་དག་ལ་རྒྱས་པར་བསྙད་ནས།
en: whereupon he related it all in detail.

source: དེ་ཐོས་མ་ཐག་ཏུ་དེ་དག་གིས་ཀྱང་མཆོད་རྟེན་དེ་ལ་བཀུར་སྟི་བྱས་ནས། སྨོན་ལམ་བཏབ་པ།
en: “As soon as they heard this, they venerated the stūpa and themselves prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་ཅག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ཕྱུག་ཅིང་། ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཤིག །
en: ‘By this root of virtue, wherever we are born, may it be into families of great means, prosperity, and wealth.

source: རྒྱལ་པོ་འདི་ཁོ་ན་ལ་བརྟེན་ནས། བདག་ཅག་གིས་སྟོན་པ་འདི་ལྟ་བུ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Entrusting ourselves to our king alone, may we please and not displease a teacher just like this one.’

source: དེའི་ཚེ་རྒྱལ་པོ་མཛེས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was King Śobha then is none other than Śakra, King of the Gods.

source: དེས་དེར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་བསྙེན་བཀུར་བྱས་ནས། སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། ཆེད་འགའ་མིར་སྐྱེས་པའི་ཚེ་ནི་ལྷ་ཆེ་བར་གྲགས་པར་གྱུར་ཏེ། ལྷ་རྣམས་ཀྱི་མངའ་བདག་བྱས་སོ། །
en: The act of venerating the totally and completely awakened Buddha Krakucchanda and the saṅgha of his disciples and saying that prayer ripened into his birth as a god, a prominent god, a lord among gods,

source: ཆེད་འགའ་མིར་སྐྱེས་པའི་ཚེ་ནི། མི་ཆེ་བར་གྲགས་པར་གྱུར་ནས། མི་རྣམས་ཀྱི་རྒྱལ་སྲིད་ཀྱི་མངའ་བདག་བྱས་ཏེ།
en: and such that when he took rebirth as a human, he became a prominent human, lord of a human kingdom.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས
en: “Now that I myself have become the very equal of the totally and completely awakened Buddha Krakucchanda—equal in strength, equal in deeds, and equal in skillful means—

source: དེའི་ཚེ་ཞམ་རིང་བ་བརྒྱད་ཁྲིར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི། ལྷ་བརྒྱད་ཁྲི་པོ་འདི་དག་ཁོ་ན་ཡིན་ཏེ།
en: “Those who were the eighty thousand servants are none other than these eighty thousand gods.

source: དེ་དག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་བསྙེན་བཀུར་བྱས་ནས། སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར། ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ།
en: The act of venerating the totally and completely awakened Buddha Krakucchanda and the saṅgha of his disciples, and saying that prayer, ripened such that wherever they were born, it was into families of great means, prosperity, and wealth,

source: བརྒྱ་བྱིན་འདི་ཁོ་ན་ལ་བརྟེན་ནས་འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་སོ།། །།
en: and that by entrusting themselves to Śakra they pleased me, and did not displease me.”

source: རྒྱལ་པོ་ཞེས་བྱ་བ་ནི།
en: The King

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན། བྲམ་ཟེ་ཞིག་གནས་པ་དེས།
en: When the Blessed One was in Śrāvastī, there lived a certain brahmin.

source: ཐབས་ཟླར་བབ་པ་ལས། ཆུང་མ་བླངས་ནས་
en: When the time came for him to marry he took a wife,

source: དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས
en: and as they enjoyed themselves and coupled, one day his wife conceived.
